from sklearn.preprocessing import MinMaxScaler, StandardScaler
from sklearn.preprocessing import MaxAbsScaler, RobustScaler
import numpy as np
from sklearn.datasets import load_breast_cancer
from sklearn.model_selection import train_test_split, KFold, cross_val_score, cross_val_predict
from sklearn.metrics import r2_score, accuracy_score
import matplotlib.pyplot as plt
from matplotlib import font_manager, rc
font_path = "C:/Windows/Fonts/gulim.TTc"
font = font_manager.FontProperties(fname=font_path).get_name()
rc('font', family=font)
import time

#1. 데이터
datasets = load_breast_cancer()
# print(datasets) (569,30)
# print(datasets.DESCR)
# print(datasets.feature_names)

x = datasets.data   #['data']
y = datasets.target #['target']
print(x.shape, y.shape) # (569,30), (569,)


x_train, x_test, y_train, y_test = train_test_split(x,y,
                                                    train_size=0.7,
                                                    random_state=66
                                                    )

n_splits = 10

kfold = KFold(n_splits=n_splits, shuffle=True, random_state=66)



# scaler = MinMaxScaler()
# scaler = StandardScaler()
# scaler = MaxAbsScaler()
scaler = RobustScaler()
scaler.fit(x_train)
x_train = scaler.transform(x_train)
x_test = scaler.transform(x_test)


#2. 모델
from sklearn.utils import all_estimators
from sklearn.metrics import accuracy_score
import warnings
warnings.filterwarnings('ignore')

allAlgorithms = all_estimators(type_filter='classifier')
#allAlgorithms = all_estimators(type_filter='classifier')

#('AdaBoostClassifier', <class 'sklearn.ensemble._weight_boosting.AdaBoostClassifier'>)

#print('allAlgorithms : ', allAlgorithms)
#print('모델갯수 : ', len(allAlgorithms)) # 모델갯수 :  41


for (name, algorithm) in allAlgorithms : 
    try:
        model = algorithm()
        # model.fit(x_train, y_train)
        scores = cross_val_score(model, x_train, y_train, cv=kfold)
        print('Model Name : ', name)
        print('ACC : ', scores) 
        print('cross_val_score : ', round(np.mean(scores), 4))
        
        y_predict = cross_val_predict(model, x_test, y_test, cv = kfold)
        print(y_predict)
        
        #y_predict = model.predict(x_test)
        # acc = accuracy_score(y_test, y_predict)
        # print(name, '의 정답률 : ', acc )
    except:
        # continue
        print(name, '은 실행되지 않는다.')
    
        

'''
Model Name :  AdaBoostClassifier
ACC :  [0.975      0.975      0.975      0.925      0.95       0.925
 1.         0.975      0.94871795 0.97435897]
cross_val_score :  0.9623
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 0 1 0 1 1 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 1 1 0 1 0 1 1 1 1
 0 1 1 1 1 1 1 0 1 0 1 1 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 1 1 0 1 0 1 0 1 1 0 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 1]
Model Name :  BaggingClassifier
ACC :  [0.925      0.975      0.95       0.9        0.95       0.9
 0.95       0.95       0.94871795 0.8974359 ]
cross_val_score :  0.9346
[1 1 1 1 1 0 0 0 0 1 0 1 1 0 1 0 0 1 0 0 1 0 1 0 0 1 0 1 0 1 1 1 0 1 0 1 0
 0 1 1 0 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 1 1 0 1 0 1 1 0 1
 0 1 1 0 1 1 1 0 1 0 1 1 1 0 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 0 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 1 0]
Model Name :  BernoulliNB
ACC :  [0.925      0.9        0.975      0.9        0.9        0.95
 0.95       0.85       0.87179487 0.92307692]
cross_val_score :  0.9145
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 0 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 0 0 1 0
 0 1 1 0 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 1 1 1 1 1 1 0 1 0 1 1 0 0 0 1 1 1 1 0 1 1 0 1 1 0 1 1 1 1 0 1 0 1 0 1 0
 1 1 0 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 1 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 0 0 1 0 1 1 1 0 0 0 0 0 0 1 0 1 1]
Model Name :  CalibratedClassifierCV
ACC :  [0.95       0.95       1.         0.95       0.95       0.925
 0.95       0.975      0.97435897 0.94871795]
cross_val_score :  0.9573
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 1 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 0 1 0 1 1 1 0 1 0 1 1 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 1]
Model Name :  CategoricalNB
ACC :  [nan nan nan nan nan nan nan nan nan nan]
cross_val_score :  nan
CategoricalNB 은 실행되지 않는다.
ClassifierChain 은 실행되지 않는다.
Model Name :  ComplementNB
ACC :  [nan nan nan nan nan nan nan nan nan nan]
cross_val_score :  nan
ComplementNB 은 실행되지 않는다.
Model Name :  DecisionTreeClassifier
ACC :  [0.975      0.975      1.         0.925      0.95       0.875
 0.9        0.95       0.92307692 0.8974359 ]
cross_val_score :  0.9371
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 0 1 1 0 0 1 0 1 0 0 1 0 1 1 1 1 1 0 0 0 1 0
 0 1 1 0 1 0 1 0 1 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 1 1 0 1 1 0 1 0 1 1 0 1
 0 1 1 0 1 1 1 0 1 0 1 1 1 1 0 1 1 1 1 0 1 0 0 1 1 1 1 1 1 1 0 1 0 1 0 1 0
 1 1 1 1 1 1 1 0 0 1 0 1 1 0 0 0 1 1 1 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 1 0]
Model Name :  DummyClassifier
ACC :  [0.55       0.625      0.7        0.575      0.7        0.65
 0.6        0.475      0.58974359 0.74358974]
cross_val_score :  0.6208
[1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1]
Model Name :  ExtraTreeClassifier
ACC :  [0.95       0.9        0.975      0.925      0.875      0.9
 0.925      0.9        0.97435897 0.8974359 ]
cross_val_score :  0.9222
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 0 0 1 0 0 1 0 1 0 0 1 0 1 0 1 1 1 0 0 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 0 0 1 1 0 0 0 1 1 1 0 1 1 1 1
 1 1 1 1 1 1 1 0 1 0 1 1 0 0 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 0 1 1 1 1 0 1 1 0 1 1 1 0 0 1 1 0 1 0 1 1 1 0 1 1 0 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 1]
Model Name :  ExtraTreesClassifier
ACC :  [0.95       0.95       0.975      0.975      0.975      0.95
 1.         0.925      0.97435897 0.94871795]
cross_val_score :  0.9623
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 0 1 0 1 1 1 1 1 0 0 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 1 1 0 1 0 1 1 1 1
 0 1 1 0 1 1 1 0 1 0 1 1 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 1 1]
Model Name :  GaussianNB
ACC :  [0.95       0.95       0.975      0.925      0.925      0.9
 0.975      0.875      0.92307692 0.8974359 ]
cross_val_score :  0.9296
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 0 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 1 1 0 1 1 1 0 1 0 1 0 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 1]
Model Name :  GaussianProcessClassifier
ACC :  [0.95       0.975      0.975      0.95       0.975      0.95
 0.95       0.95       0.97435897 0.94871795]
cross_val_score :  0.9598
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 1 1 1 1 1 1 0 1 0 1 0 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 1]
Model Name :  GradientBoostingClassifier
ACC :  [0.95       1.         0.975      0.95       0.95       0.9
 1.         0.95       0.97435897 0.94871795]
cross_val_score :  0.9598
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 0 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 0 0 1 0
 0 1 1 0 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 1 1 0 1 0 1 1 0 1
 0 1 1 0 1 1 1 0 1 0 1 1 1 0 0 1 1 1 1 0 1 0 0 1 1 1 1 1 1 1 0 1 0 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 1 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 1 1]
Model Name :  HistGradientBoostingClassifier
ACC :  [0.975      0.975      1.         0.975      0.975      0.925
 0.975      0.975      0.97435897 0.94871795]
cross_val_score :  0.9698
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 1 0 1 0
 0 1 1 0 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 0 0 1 1 1 0 1 1 0 1 0 1 1 1 1
 0 1 1 0 1 1 1 0 1 0 1 1 0 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 0 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 1 1 0 1 0 1 0 1 1 0 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 1 1]
Model Name :  KNeighborsClassifier
ACC :  [0.95       0.975      0.95       0.95       0.975      0.95
 0.975      0.975      0.97435897 0.94871795]
cross_val_score :  0.9623
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 0 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 1 1 1 1 1 1 0 1 0 1 0 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 1 1 1 0 1 1]
Model Name :  LabelPropagation
ACC :  [0.95       0.975      0.975      0.9        0.975      0.95
 0.975      0.975      0.97435897 0.94871795]
cross_val_score :  0.9598
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 0 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 1 1 1 1 1 1 0 1 0 1 0 1 1 0 1 1 1 0 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 0 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 1 1 1 0 1 1]
Model Name :  LabelSpreading
ACC :  [0.95       0.975      0.975      0.9        0.975      0.95
 0.975      0.975      0.97435897 0.94871795]
cross_val_score :  0.9598
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 0 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 1 1 1 1 1 1 0 1 0 1 0 1 1 0 1 1 1 0 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 0 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 1 1 1 0 1 1]
Model Name :  LinearDiscriminantAnalysis
ACC :  [0.925      0.9        1.         0.925      0.975      0.925
 0.925      0.975      0.97435897 1.        ]
cross_val_score :  0.9524
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 1 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 0 1 1 1 1 1 0 1 0 1 1 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 1 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 1]
Model Name :  LinearSVC
ACC :  [0.95       0.95       1.         0.975      0.95       0.95
 0.925      1.         0.94871795 0.97435897]
cross_val_score :  0.9623
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 0 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 0 1 0 1 1 1 0 1 0 1 1 1 0 0 1 1 1 1 0 1 1 0 1 1 0 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 0 1 0 1 0 1 0 1 1 0 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 0]
Model Name :  LogisticRegression
ACC :  [0.95       0.95       0.975      0.975      0.95       0.95
 1.         1.         0.97435897 1.        ]
cross_val_score :  0.9724
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 0 1 0 1 1 1 0 1 0 1 1 1 0 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 1]
Model Name :  LogisticRegressionCV
ACC :  [0.95       0.975      1.         0.95       0.975      0.95
 0.975      1.         0.97435897 0.97435897]
cross_val_score :  0.9724
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 0 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 0 1 0 1 1 1 0 1 0 1 1 1 0 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 0]
Model Name :  MLPClassifier
ACC :  [0.95       0.975      0.975      1.         0.95       0.925
 0.975      1.         0.97435897 1.        ]
cross_val_score :  0.9724
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 0 1 0 1 1 1 1 1 0 0 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 0 1 0 1 1 1 0 1 0 1 1 1 0 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 0 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 1 1]
MultiOutputClassifier 은 실행되지 않는다.
Model Name :  MultinomialNB
ACC :  [nan nan nan nan nan nan nan nan nan nan]
cross_val_score :  nan
MultinomialNB 은 실행되지 않는다.
Model Name :  NearestCentroid
ACC :  [0.925      0.95       1.         0.875      0.975      0.925
 0.95       0.825      0.94871795 0.87179487]
cross_val_score :  0.9246
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 0 0 1 0 0 1 0 1 0 1 1 0 1 0 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 1 1 0 1 0 1 1 1 1
 0 1 1 1 1 1 1 0 1 0 1 1 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 1]
Model Name :  NuSVC
ACC :  [0.95       0.975      0.975      0.875      1.         0.925
 0.975      0.875      1.         0.92307692]
cross_val_score :  0.9473
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 0 0 1 0 0 1 0 1 0 1 1 0 1 0 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 1 1 1 1 1 1 0 1 0 1 0 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 1]
OneVsOneClassifier 은 실행되지 않는다.
OneVsRestClassifier 은 실행되지 않는다.
OutputCodeClassifier 은 실행되지 않는다.
Model Name :  PassiveAggressiveClassifier
ACC :  [0.95       0.925      0.975      0.975      0.975      0.9
 0.925      1.         0.97435897 0.94871795]
cross_val_score :  0.9548
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 0 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 0 1
 0 0 1 0 0 1 1 0 1 0 1 1 1 0 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 0 1 0 1 0 1 0 1 1 0 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 1 0]
Model Name :  Perceptron
ACC :  [0.95       0.95       0.975      0.975      0.95       0.9
 0.95       0.975      0.97435897 0.97435897]
cross_val_score :  0.9574
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 0 1 0 1 1 1 1 1 0 0 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 0 1 0 0 1 1 0 1 0 1 1 1 0 0 1 1 1 1 0 1 1 0 1 1 0 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 0 1 0 1 0 1 0 1 1 0 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 1 0]
Model Name :  QuadraticDiscriminantAnalysis
ACC :  [1.         1.         0.975      0.925      0.95       0.925
 0.975      0.975      0.92307692 0.94871795]
cross_val_score :  0.9597
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 0 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 1 1 0 0 1 1 1 0 1 1 1 1
 0 1 1 0 1 1 1 0 1 0 1 1 1 0 0 1 1 1 1 0 1 1 0 1 1 0 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 0 1 0 0 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 0]
Model Name :  RadiusNeighborsClassifier
ACC :  [nan nan nan nan nan nan nan nan nan nan]
cross_val_score :  nan
RadiusNeighborsClassifier 은 실행되지 않는다.
Model Name :  RandomForestClassifier
ACC :  [0.95       0.975      0.975      0.95       0.975      0.925
 1.         0.925      0.97435897 0.92307692]
cross_val_score :  0.9572
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 0 0 1 0 0 1 0 1 0 0 1 0 1 1 1 1 1 0 0 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 1 1 0 1 0 1 1 1 1
 0 1 1 0 1 1 1 0 1 0 1 1 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 1 0]
Model Name :  RidgeClassifier
ACC :  [0.925      0.925      1.         0.925      0.975      0.95
 0.95       0.975      0.97435897 1.        ]
cross_val_score :  0.9599
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 0 1 1 1 1 1 0 1 0 1 1 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 1 1]
Model Name :  RidgeClassifierCV
ACC :  [0.925      0.925      1.         0.925      0.975      0.95
 0.95       0.975      0.97435897 1.        ]
cross_val_score :  0.9599
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 0 1 1 1 1 1 0 1 0 1 1 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 1]
Model Name :  SGDClassifier
ACC :  [0.95       0.975      0.975      0.975      0.95       0.925
 0.975      1.         0.94871795 0.97435897]
cross_val_score :  0.9648
[1 1 1 1 1 0 0 1 1 1 0 1 1 0 1 1 0 1 0 0 1 0 1 0 1 1 0 1 1 1 1 1 0 0 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 0 1 0 0 1 1 0 1 0 1 1 1 0 0 1 1 1 1 0 1 1 0 1 1 0 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 1 1 1 0 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 1 0]
Model Name :  SVC
ACC :  [0.95       1.         1.         0.95       0.975      0.95
 0.975      1.         1.         0.94871795]
cross_val_score :  0.9749
[1 1 1 1 1 0 0 0 1 1 0 1 1 0 1 0 0 1 0 0 1 0 1 0 1 1 0 1 0 1 1 1 0 1 0 1 0
 0 1 1 1 1 0 1 0 1 1 1 0 0 0 1 0 1 1 0 1 0 1 1 0 1 1 1 0 0 1 0 1 0 1 1 1 1
 0 1 1 1 1 1 1 0 1 0 1 0 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1 1 1 1 0 1 1 1 0 1 0
 1 1 1 1 1 1 1 0 1 1 0 1 1 0 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 0 1 1 1 0 1 1 1
 1 0 1 1 1 1 1 0 1 0 1 1 1 0 1 0 0 0 1 1 0 1 1]
StackingClassifier 은 실행되지 않는다.
VotingClassifier 은 실행되지 않는다.
'''